tonhathuy/camera-web-server-esp32-cam/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t gallery_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  
  // Send HTML header in chunks to reduce stack usage
  httpd_resp_send_chunk(req, 
    "<!DOCTYPE html><html><head>"
    "<title>ESP32-CAM Gallery</title>"
    "<meta name='viewport' content='width=device-width, initial-scale=1'>"
    "<style>"
    "body{font-family:Arial;margin:20px;background:#f0f0f0;}"
    ".container{max-width:1200px;margin:0 auto;}"
    ".header{text-align:center;margin-bottom:30px;}", -1);
    
  httpd_resp_send_chunk(req,
    ".gallery{display:grid;grid-template-columns:repeat(auto-fill,minmax(200px,1fr));gap:15px;}"
    ".image-card{background:white;border-radius:8px;padding:10px;box-shadow:0 2px 5px rgba(0,0,0,0.1);transition:transform 0.2s;}"
    ".image-card:hover{transform:scale(1.05);}"
    ".image-card img{width:100%;height:150px;object-fit:cover;border-radius:4px;cursor:pointer;background:#f0f0f0;transition:all 0.3s;filter:brightness(0.9);}"
    ".image-card img:hover{filter:brightness(1);}"
    ".image-card img.loading{opacity:0.5;background:linear-gradient(90deg,#f0f0f0 25%,#e0e0e0 50%,#f0f0f0 75%);background-size:200% 100%;animation:loading 1.5s infinite;}"
    ".image-info{margin-top:8px;font-size:12px;color:#666;text-align:center;}"
    "@keyframes loading{0%{background-position:200% 0;}100%{background-position:-200% 0;}}", -1);
    
  httpd_resp_send_chunk(req,
    ".no-images{text-align:center;color:#666;margin-top:50px;}"
    ".refresh-btn{background:#4CAF50;color:white;padding:10px 20px;border:none;border-radius:4px;cursor:pointer;margin:10px;}"
    ".refresh-btn:hover{background:#45a049;}"
    "</style>"
    "</head><body>"
    "<div class='container'>", -1);
    
  httpd_resp_send_chunk(req,
    "<div class='header'>"
    "<h1>📷 ESP32-CAM Gallery</h1>"
    "<button class='refresh-btn' onclick='location.reload()'>🔄 Refresh</button>"
    "<button class='refresh-btn' onclick='location.href=\"/camera\"'>📹 Camera Controls</button>"
    "</div>"
    "<div class='gallery'>", -1);
  
  // List images from SD card
  File root = SD_MMC.open("/");
  if (!root) {
    httpd_resp_send_chunk(req, "<div class='no-images'>❌ Cannot access SD card</div>", -1);
  } else {
    int imageCount = 0;
    File file = root.openNextFile();
    while (file) {
      String fileName = file.name();
      
      // Skip directories and non-jpg files
      if (!file.isDirectory() && (fileName.endsWith(".jpg") || fileName.endsWith(".JPG"))) {
        imageCount++;
        
        // Ensure filename starts with /
        String fullPath = fileName;
        if (!fullPath.startsWith("/")) {
          fullPath = "/" + fullPath;
        }
        
        char imageCard[450];
        snprintf(imageCard, sizeof(imageCard),
          "<div class='image-card'>"
          "<img src='/image%s?thumb=1' alt='%s' onclick='window.open(\"/image%s\", \"_blank\")' loading='lazy'>"
          "<div class='image-info'>%s<br>%.1f KB</div>"
          "</div>",
          fullPath.c_str(), fileName.c_str(), fullPath.c_str(), 
          fileName.c_str(), file.size() / 1024.0);
        
        httpd_resp_send_chunk(req, imageCard, strlen(imageCard));
      }
      file = root.openNextFile();
    }
    root.close();
    
    if (imageCount == 0) {
      httpd_resp_send_chunk(req, "<div class='no-images'>📷 No images found on SD card</div>", -1);
    }
  }
  
  // HTML footer with JavaScript
  httpd_resp_send_chunk(req,
    "</div>"
    "<div style='text-align:center;margin-top:30px;color:#666;'>"
    "<p>📷 Gallery optimized for fast browsing. Images are automatically resized for thumbnails. Click any image to view full size.</p>"
    "</div>"
    "</div>"
    "<script>"
    "document.querySelectorAll('img').forEach(img=>{"
    "img.classList.add('loading');"
    "img.onload=()=>{img.classList.remove('loading');img.style.opacity='1';};"
    "img.onerror=()=>{img.classList.remove('loading');img.style.opacity='0.3';};"
    "});"
    "let loaded=0,total=document.querySelectorAll('img').length;"
    "document.querySelectorAll('img').forEach(img=>{"
    "img.addEventListener('load',()=>{"
    "loaded++;if(loaded===total)console.log('All images loaded');"
    "});"
    "});"
    "</script>"
    "</body></html>", -1);
  
