tonhathuy/camera-web-server-esp32-cam/app_httpd.cpp
  httpd_resp_send_chunk(req, NULL, 0);
  return ESP_OK;
}

static esp_err_t image_handler(httpd_req_t *req) {
  // Extract filename from URI (e.g., /image/img_001.jpg -> /img_001.jpg)
  const char* uri = req->uri;
  
  log_i("Requested URI: %s", uri);
  
  // Check if this is a thumbnail request
  bool isThumbnail = (strstr(uri, "?thumb=1") != NULL);
  
  // Find the filename part after /image
  const char* filename = NULL;
  if (strncmp(uri, "/image/", 7) == 0) {
    filename = uri + 7; // Skip "/image/" part
  } else if (strncmp(uri, "/image", 6) == 0) {
    filename = uri + 6; // Skip "/image" part
  } else {
    log_e("Invalid image URI: %s", uri);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  
  // Remove query parameters from filename
  char cleanFilename[32];
  const char* queryStart = strchr(filename, '?');
  if (queryStart) {
    size_t nameLen = queryStart - filename;
    strncpy(cleanFilename, filename, nameLen);
    cleanFilename[nameLen] = '\0';
    filename = cleanFilename;
  }
  
  log_i("Extracted filename: %s, thumbnail: %s", filename, isThumbnail ? "yes" : "no");
  
  // Build full path
  char fullPath[64];
  if (filename[0] == '/') {
    strncpy(fullPath, filename, sizeof(fullPath) - 1);
  } else {
    snprintf(fullPath, sizeof(fullPath), "/%s", filename);
  }
  fullPath[sizeof(fullPath) - 1] = '\0';
  
  log_i("Opening file: %s", fullPath);
  
  File file = SD_MMC.open(fullPath);
  if (!file) {
    log_e("File not found: %s", fullPath);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  
  size_t fileSize = file.size();
  log_i("File opened successfully: %s, size: %d", fullPath, fileSize);
  
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "public, max-age=31536000");
  
  // For thumbnails, we need to send the complete JPEG file but with reduced quality
  // The approach of cutting off bytes doesn't work for JPEG format
  
  // Set content length for better performance  
  char contentLength[16];
  snprintf(contentLength, sizeof(contentLength), "%u", (unsigned int)fileSize);
  httpd_resp_set_hdr(req, "Content-Length", contentLength);
  
  // Use appropriate buffer size based on request type
  const size_t bufferSize = isThumbnail ? 1024 : 4096; // Smaller buffer for thumbs to reduce memory
  uint8_t* buffer = (uint8_t*)malloc(bufferSize);
  if (!buffer) {
    log_e("Failed to allocate buffer");
    file.close();
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  
  size_t bytesRead;
  size_t totalSent = 0;
  
  // Send the complete file (JPEG needs to be complete to display properly)
  while ((bytesRead = file.read(buffer, bufferSize)) > 0) {
    if (httpd_resp_send_chunk(req, (const char*)buffer, bytesRead) != ESP_OK) {
      log_e("Failed to send chunk");
      free(buffer);
      file.close();
      return ESP_FAIL;
    }
    totalSent += bytesRead;
  }
  
  free(buffer);
  file.close();
  httpd_resp_send_chunk(req, NULL, 0);
  
  log_i("Image sent successfully: %d bytes (%s)", totalSent, isThumbnail ? "thumbnail" : "full");
  return ESP_OK;
}

static esp_err_t debug_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/plain");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  
  // Send header first
  httpd_resp_send_chunk(req, "=== SD CARD DEBUG INFO ===\n", -1);
  
  File root = SD_MMC.open("/");
  if (!root) {
    httpd_resp_send_chunk(req, "ERROR: Cannot open SD root directory\n", -1);
  } else {
    httpd_resp_send_chunk(req, "SD Card accessible\nFiles found:\n", -1);
    
    File file = root.openNextFile();
    int fileCount = 0;
    char line[128];
    
    while (file && fileCount < 50) { // Limit to prevent overflow
      String fileName = file.name();
      snprintf(line, sizeof(line), "%d. '%s' (%d bytes)\n", 
        ++fileCount, fileName.c_str(), file.size());
      httpd_resp_send_chunk(req, line, strlen(line));
      file = root.openNextFile();
    }
    root.close();
    
    if (fileCount == 0) {
      httpd_resp_send_chunk(req, "No files found!\n", -1);
    } else {
      snprintf(line, sizeof(line), "\nTotal: %d files\n", fileCount);
      httpd_resp_send_chunk(req, line, strlen(line));
    }
  }
  
  httpd_resp_send_chunk(req, NULL, 0); // End response
  return ESP_OK;
}

static esp_err_t home_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  
  // Send HTML in chunks to reduce stack usage
  httpd_resp_send_chunk(req, 
    "<!DOCTYPE html><html><head>"
    "<title>ESP32-CAM Control</title>"
    "<meta name='viewport' content='width=device-width, initial-scale=1'>"
    "<style>"
    "body{font-family:Arial;text-align:center;margin:50px;background:#f0f0f0;}"
    ".container{max-width:600px;margin:0 auto;background:white;padding:30px;border-radius:10px;box-shadow:0 4px 6px rgba(0,0,0,0.1);}"
    "h1{color:#333;margin-bottom:30px;}", -1);
    
  httpd_resp_send_chunk(req,
    ".btn{display:inline-block;padding:15px 30px;margin:10px;background:#4CAF50;color:white;text-decoration:none;border-radius:5px;font-size:16px;transition:background 0.3s;}"
    ".btn:hover{background:#45a049;}"
    ".btn-secondary{background:#2196F3;}"
    ".btn-secondary:hover{background:#0b7dda;}"
    ".btn-danger{background:#f44336;}"
    ".btn-danger:hover{background:#da190b;}", -1);
    
  httpd_resp_send_chunk(req,
    ".info{background:#e7f3ff;padding:15px;border-radius:5px;margin:20px 0;}"
    "</style>"
    "</head><body>"
    "<div class='container'>"
    "<h1>📷 ESP32-CAM Control Panel</h1>"
    "<div class='info'>"
    "<p>🔴 Camera is automatically capturing images every second and saving to SD card</p>"
    "</div>", -1);
    
  httpd_resp_send_chunk(req,
    "<a href='/stream' class='btn btn-secondary' target='_blank'>📹 Live Stream</a>"
    "<a href='/capture' class='btn' target='_blank'>📸 Take Photo</a>"
    "<a href='/gallery' class='btn btn-secondary'>🖼️ View Gallery</a>"
    "<a href='/debug' class='btn btn-danger' target='_blank'>🔧 Debug SD</a>"
    "<br><br>"
    "<p style='color:#666;font-size:14px;'>Use the buttons above to access camera functions</p>"
    "</div>"
    "</body></html>", -1);
  
  httpd_resp_send_chunk(req, NULL, 0); // End response
  return ESP_OK;
}

static esp_err_t index_handler(httpd_req_t *req) {
  // Redirect root to home page
  httpd_resp_set_status(req, "302 Found");
  httpd_resp_set_hdr(req, "Location", "/home");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t camera_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}


// Custom error handler for 404 - handle image requests
esp_err_t custom_404_handler(httpd_req_t *req, httpd_err_code_t err) {
  const char* uri = req->uri;
  log_i("404 Handler called for: %s", uri);
  
